m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>CTL</name>
          <displayName>TIMER_CTL</displayName>
          <description>GPTM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAEN</name>
              <description>GPTM Timer A Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TASTALL</name>
              <description>GPTM Timer A Stall Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAEVENT</name>
              <description>GPTM Timer A Event Mode</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>GPTM RTC Stall Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAOTE</name>
              <description>GPTM Timer A Output Trigger Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAPWML</name>
              <description>GPTM Timer A PWM Output Level</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TBEN</name>
              <description>GPTM Timer B Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TBSTALL</name>
              <description>GPTM Timer B Stall Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TBEVENT</name>
              <description>GPTM Timer B Event Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POS</name>
                  <description>Positive edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <description>Negative edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBOTE</name>
              <description>GPTM Timer B Output Trigger Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TBPWML</name>
              <description>GPTM Timer B PWM Output Level</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <displayName>TIMER_SYNC</displayName>
          <description>GPTM Synchronize</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNCT0</name>
              <description>Synchronize GPTM Timer 0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM0 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM0 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM0 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM0 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT1</name>
              <description>Synchronize GPTM Timer 1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM1 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM1 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM1 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM1 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT2</name>
              <description>Synchronize GPTM Timer 2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM2 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM2 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM2 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM2 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT3</name>
              <description>Synchronize GPTM Timer 3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM3 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM3 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM3 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM3 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT4</name>
              <description>Synchronize GPTM Timer 4</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM4 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM4 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM4 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM4 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT5</name>
              <description>Synchronize GPTM Timer 5</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM5 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM5 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM5 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM5 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT6</name>
              <description>Synchronize GPTM Timer 6</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPTM6 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM6 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM6 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM6 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCT7</name>
              <description>Synchronize GPTM Timer 7</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>GPT7 is not affected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA</name>
                  <description>A timeout event for Timer A of GPTM7 is triggered</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB</name>
                  <description>A timeout event for Timer B of GPTM7 is triggered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TATB</name>
                  <description>A timeout event for both Timer A and Timer B of GPTM7 is triggered</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <displayName>TIMER_IMR</displayName>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAMIM</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAEIM</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTCIM</name>
              <description>GPTM RTC Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAMIM</name>
              <description>GPTM Timer A Match Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAAIM</name>
              <description>GPTM Timer A DMA Done Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CBMIM</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CBEIM</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TBMIM</name>
              <description>GPTM Timer B Match Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMABIM</name>
              <description>GPTM Timer B DMA Done Interrupt Mask</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
