m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>DMAADDR6</name>
          <displayName>USB_DMAADDR6</displayName>
          <description>USB DMA Address 6</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT6</name>
          <displayName>USB_DMACOUNT6</displayName>
          <description>USB DMA Count 6</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL7</name>
          <displayName>USB_DMACTL7</displayName>
          <description>USB DMA Control 7</description>
          <addressOffset>0x00000274</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DMA Transfer Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA Direction</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA Transfer Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE</name>
              <description>DMA Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP</name>
              <description>Endpoint number</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>Bus Error Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BRSTM</name>
              <description>Burst Mode</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR7</name>
          <displayName>USB_DMAADDR7</displayName>
          <description>USB DMA Address 7</description>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Address</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT7</name>
          <displayName>USB_DMACOUNT7</displayName>
          <description>USB DMA Count 7</description>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>DMA Count</description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT1</name>
          <displayName>USB_RQPKTCOUNT1</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 1</description>
          <addressOffset>0x00000304</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RQPKTCOUNT2</name>
          <displayName>USB_RQPKTCOUNT2</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 2</description>
          <addressOffset>0x00000308</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RQPKTCOUNT3</name>
          <displayName>USB_RQPKTCOUNT3</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 3</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RQPKTCOUNT4</name>
          <displayName>USB_RQPKTCOUNT4</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 4</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Block Transfer Packet Count</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT5</name>
          <displayName>USB_RQPKTCOUNT5</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 5</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Block Transfer Packet Count</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT6</name>
          <displayName>USB_RQPKTCOUNT6</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 6</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Block Transfer Packet Count</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT7</name>
          <displayName>USB_RQPKTCOUNT7</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 7</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Block Transfer Packet Count</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDPKTBUFDIS</name>
          <displayName>USB_RXDPKTBUFDIS</displayName>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDPKTBUFDIS</name>
          <displayName>USB_TXDPKTBUFDIS</displayName>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTO</name>
          <displayName>USB_CTO</displayName>
          <description>USB Chirp Timeout</description>
          <addressOffset>0x00000344</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CCTV</name>
              <description>Configurable Chirp Timeout Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HHSRTN</name>
          <displayName>USB_HHSRTN</displayName>
          <description>USB High Speed to UTM Operating Delay</description>
          <addressOffset>0x00000346</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HHSRTN</name>
              <description>HIgh Speed to UTM Operating Delay</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSBT</name>
          <displayName>USB_HSBT</displayName>
          <description>USB High Speed Time-out Adder</description>
          <addressOffset>0x00000348</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HSBT</name>
              <description>High Speed Timeout Adder</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMATTR</name>
          <displayName>USB_LPMATTR</displayName>
          <description>USB LPM Attributes</description>
          <addressOffset>0x00000360</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LS</name>
              <description>Link State</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L1</name>
                  <description>Sleep State (L1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIRD</name>
              <description>Host Initiated Resume Duration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RMTWAK</name>
              <description>Remote Wake</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ENDPT</name>
              <description>Endpoint</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMCNTRL</name>
          <displayName>USB_LPMCNTRL</displayName>
          <description>USB LPM Control</description>
          <addressOffset>0x00000362</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXLPM</name>
              <description>Transmit LPM Transaction Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RES</name>
              <description>LPM Resume</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EN</name>
              <description>LPM Enable</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>LPM and Extended transactions are not supported. In this case, the USB does not respond to LPM transactions and LPM transactions cause a timeout</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>LPM is not supported but extended transactions are supported. In this case, the USB does respond to an LPM transaction with a STALL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMEXT</name>
                  <description>The USB supports LPM extended transactions. In this case, the USB responds with a NYET or an ACK as determined by the value of TXLPM and other conditions</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAK</name>
              <description>LPM NAK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
