m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>PC</name>
          <displayName>USB_PC</displayName>
          <description>USB Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ULPIEN</name>
              <description>ULPI Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>USB_CC</displayName>
          <description>USB Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>PLL Clock Divisor</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CSD</name>
              <description>Clock Source/Direction</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKEN</name>
              <description>USB Clock Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/gpio.xml -->
    <peripheral>
      <name>GPIO_PORTA_AHB</name>
      <description>GPIO register offsets</description>
      <baseAddress>0x40058000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <displayName>GPIO_DATA</displayName>
          <description>GPIO Data</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DIR</name>
          <displayName>GPIO_DIR</displayName>
          <description>GPIO Direction</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IS</name>
          <displayName>GPIO_IS</displayName>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IBE</name>
          <displayName>GPIO_IBE</displayName>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IEV</name>
          <displayName>GPIO_IEV</displayName>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IM</name>
          <displayName>GPIO_IM</displayName>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO</name>
              <description>GPIO Interrupt Mask Enable</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIME</name>
              <description>GPIO uDMA Done Interrupt Mask Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>GPIO_RIS</displayName>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO</name>
              <description>GPIO Interrupt Raw Status</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMARIS</name>
              <description>GPIO uDMA Done Interrupt Raw Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>GPIO_MIS</displayName>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO</name>
              <description>GPIO Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAMIS</name>
              <description>GPIO uDMA Done Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>GPIO_ICR</displayName>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO</name>
              <description>GPIO Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>DMAIC</name>
              <description>GPIO uDMA Interrupt Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AFSEL</name>
          <displayName>GPIO_AFSEL</displayName>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DR2R</name>
          <displayName>GPIO_DR2R</displayName>
          <description>GPIO 2-mA Drive Select</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DR4R</name>
          <displayName>GPIO_DR4R</displayName>
          <description>GPIO 4-mA Drive Select</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DR8R</name>
          <displayName>GPIO_DR8R</displayName>
          <description>GPIO 8-mA Drive Select</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ODR</name>
          <displayName>GPIO_ODR</displayName>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PUR</name>
          <displayName>GPIO_PUR</displayName>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PDR</name>
          <displayName>GPIO_PDR</displayName>
          <description>GPIO Pull-Down Select</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SLR</name>
          <displayName>GPIO_SLR</displayName>
          <description>GPIO Slew Rate Control Select</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DEN</name>
          <displayName>GPIO_DEN</displayName>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>LOCK</name>
          <displayName>GPIO_LOCK</displayName>
          <description>GPIO Lock</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_LOCK</name>
              <description>GPIO Lock</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>The GPIOCR register is unlocked and may be modified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>The GPIOCR register is locked and may not be modified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY</name>
                  <description>Unlocks the GPIO_CR register</description>
                  <value>0x4c4f434b</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>GPIO_CR</displayName>
          <description>GPIO Commit</description>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>AMSEL</name>
          <displayName>GPIO_AMSEL</displayName>
          <description>GPIO Analog Mode Select</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PCTL</name>
          <displayName>GPIO_PCTL</displayName>
          <description>GPIO Port Control</description>
          <addressOffset>0x0000052C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ADCCTL</name>
          <displayName>GPIO_ADCCTL</displayName>
          <description>GPIO ADC Control</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DMACTL</name>
          <displayName>GPIO_DMACTL</displayName>
          <description>GPIO DMA Control</description>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SI</name>
          <displayName>GPIO_SI</displayName>
          <description>GPIO Select Interrupt</description>
          <addressOffset>0x00000538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUM</name>
              <description>Summary Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DR12R</name>
          <displayName>GPIO_DR12R</displayName>
          <description>GPIO 12-mA Drive Select</description>
          <addressOffset>0x0000053C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DRV12</name>
              <description>Output Pad 12-mA Drive Enable</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_12MA</name>
                  <description>The corresponding GPIO pin has 12-mA drive. This encoding is only valid if the GPIOPP EDE bit is set and the appropriate GPIOPC EDM bit field is programmed to 0x3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEPEN</name>
          <displayName>GPIO_WAKEPEN</displayName>
          <description>GPIO Wake Pin Enable</description>
          <addressOffset>0x00000540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAKEP4</name>
              <description>P[4] Wake Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKELVL</name>
          <displayName>GPIO_WAKELVL</displayName>
          <description>GPIO Wake Level</description>
          <addressOffset>0x00000544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAKELVL4</name>
              <description>P[4] Wake Level</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKESTAT</name>
          <displayName>GPIO_WAKESTAT</displayName>
          <description>GPIO Wake Status</description>
          <addressOffset>0x00000548</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STAT4</name>
              <description>P[4] Wake Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>GPIO_PP</displayName>
          <description>GPIO Peripheral Property</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EDE</name>
              <description>Extended Drive Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>GPIO_PC</displayName>
          <description>GPIO Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EDM0</name>
              <description>Extended Drive Mode Bit 0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Drive values of 2, 4 and 8 mA are maintained. GPIO n Drive Select (GPIODRnR) registers function as normal</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6MA</name>
                  <description>An additional 6 mA option is provided</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLUS2MA</name>
                  <description>A 2 mA driver is always enabled; setting the corresponding GPIODR4R register bit adds 2 mA and setting the corresponding GPIODR8R of GPIODR12R register bit adds an additional 4 mA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDM1</name>
              <description>Extended Drive Mode Bit 1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM2</name>
              <description>Extended Drive Mode Bit 2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM3</name>
              <description>Extended Drive Mode Bit 3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM4</name>
              <description>Extended Drive Mode Bit 4</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM5</name>
              <description>Extended Drive Mode Bit 5</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM6</name>
              <description>Extended Drive Mode Bit 6</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EDM7</name>
              <description>Extended Drive Mode Bit 7</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
