m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>HB8TIME</name>
          <displayName>EPI_HB8TIME</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME</name>
          <displayName>EPI_HB16TIME</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME2</name>
          <displayName>EPI_HB8TIME2</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME2</name>
          <displayName>EPI_HB16TIME2</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME3</name>
          <displayName>EPI_HB16TIME3</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME3</name>
          <displayName>EPI_HB8TIME3</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME4</name>
          <displayName>EPI_HB8TIME4</displayName>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME4</name>
          <displayName>EPI_HB16TIME4</displayName>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HBPSRAM</name>
          <displayName>EPI_HBPSRAM</displayName>
          <description>EPI Host-Bus PSRAM</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CR</name>
              <description>PSRAM Config Register</description>
              <lsb>0</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
