m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>MIIDATA</name>
          <displayName>EMAC_MIIDATA</displayName>
          <description>Ethernet MAC MII Data Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>MII Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLOWCTL</name>
          <displayName>EMAC_FLOWCTL</displayName>
          <description>Ethernet MAC Flow Control</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FCBBPA</name>
              <description>Flow Control Busy or Back-pressure Activate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit Flow Control Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RFE</name>
              <description>Receive Flow Control Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UP</name>
              <description>Unicast Pause Frame Detect</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DZQP</name>
              <description>Disable Zero-Quanta Pause</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PT</name>
              <description>Pause Time</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VLANTG</name>
          <displayName>EMAC_VLANTG</displayName>
          <description>Ethernet MAC VLAN Tag</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VL</name>
              <description>VLAN Tag Identifier for Receive Frames</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ETV</name>
              <description>Enable 12-Bit VLAN Tag Comparison</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VTIM</name>
              <description>VLAN Tag Inverse Match Enable</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ESVL</name>
              <description>Enable S-VLAN</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VTHM</name>
              <description>VLAN Tag Hash Table Match Enable</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>EMAC_STATUS</displayName>
          <description>Ethernet MAC Status</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RPE</name>
              <description>MAC MII Receive Protocol Engine Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RFCFC</name>
              <description>MAC Receive Frame Controller FIFO Status</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RWC</name>
              <description>TX/RX Controller RX FIFO Write Controller Active Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RRC</name>
              <description>TX/RX Controller Read Controller State</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATUS</name>
                  <description>Reading frame data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA</name>
                  <description>Reading frame status (or timestamp)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLUSH</name>
                  <description>Flushing the frame data and status</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXF</name>
              <description>TX/RX Controller RX FIFO Fill-level Status</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>RX FIFO Empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>RX FIFO fill level is below the flow-control deactivate threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>RX FIFO fill level is above the flow-control activate threshold</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>RX FIFO Full</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPE</name>
              <description>MAC MII Transmit Protocol Engine Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFC</name>
              <description>MAC Transmit Frame Controller Status</description>
              <lsb>17</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATUS</name>
                  <description>Waiting for status of previous frame or IFG or backoff period to be over</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>Generating and transmitting a PAUSE control frame (in the full-duplex mode)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Transferring input frame for transmission</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPAUSED</name>
              <description>MAC Transmitter PAUSE</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRC</name>
              <description>TX/RX Controller's TX FIFO Read Controller Status</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>READ state (transferring data to MAC transmitter)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Waiting for TX Status from MAC transmitter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRFLUSH</name>
                  <description>Writing the received TX Status or flushing the TX FIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWC</name>
              <description>TX/RX Controller TX FIFO Write Controller Active Status</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXFE</name>
              <description>TX/RX Controller TX FIFO Not Empty Status</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXFF</name>
              <description>TX/RX Controller TX FIFO Full Status</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RWUFF</name>
          <displayName>EMAC_RWUFF</displayName>
          <description>Ethernet MAC Remote Wake-Up Frame Filter</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAKEUPFIL</name>
              <description>Remote Wake-Up Frame Filter</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMTCTLSTAT</name>
          <displayName>EMAC_PMTCTLSTAT</displayName>
          <description>Ethernet MAC PMT Control and Status Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWRDWN</name>
              <description>Power Down</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MGKPKTEN</name>
              <description>Magic Packet Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUPFREN</name>
              <description>Wake-Up Frame Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MGKPRX</name>
              <description>Magic Packet Received</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUPRX</name>
              <description>Wake-Up Frame Received</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GLBLUCAST</name>
              <description>Global Unicast</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RWKPTR</name>
              <description>Remote Wake-Up FIFO Pointer</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPFRRST</name>
              <description>Wake-Up Frame Filter Register Pointer Reset</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>EMAC_RIS</displayName>
          <description>Ethernet MAC Raw Interrupt Status</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMT</name>
              <description>PMT Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMC</name>
              <description>MMC Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMCRX</name>
              <description>MMC Receive Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MMCTX</name>
              <description>MMC Transmit Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS</name>
              <description>Timestamp Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>EMAC_IM</displayName>
          <description>Ethernet MAC Interrupt Mask</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMT</name>
              <description>PMT Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSI</name>
              <description>Timestamp Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0H</name>
          <displayName>EMAC_ADDR0H</displayName>
          <description>Ethernet MAC Address 0 High</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address0 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0L</name>
          <displayName>EMAC_ADDR0L</displayName>
          <description>Ethernet MAC Address 0 Low Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address0 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
