m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>ADDR1H</name>
          <displayName>EMAC_ADDR1H</displayName>
          <description>Ethernet MAC Address 1 High</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address1 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR1L</name>
          <displayName>EMAC_ADDR1L</displayName>
          <description>Ethernet MAC Address 1 Low</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address1 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2H</name>
          <displayName>EMAC_ADDR2H</displayName>
          <description>Ethernet MAC Address 2 High</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address2 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR2L</name>
          <displayName>EMAC_ADDR2L</displayName>
          <description>Ethernet MAC Address 2 Low</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address2 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR3H</name>
          <displayName>EMAC_ADDR3H</displayName>
          <description>Ethernet MAC Address 3 High</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRHI</name>
              <description>MAC Address3 [47:32]</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR3L</name>
          <displayName>EMAC_ADDR3L</displayName>
          <description>Ethernet MAC Address 3 Low</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDRLO</name>
              <description>MAC Address3 [31:0]</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOGTO</name>
          <displayName>EMAC_WDOGTO</displayName>
          <description>Ethernet MAC Watchdog Timeout</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WTO</name>
              <description>Watchdog Timeout</description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWE</name>
              <description>Programmable Watchdog Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCCTRL</name>
          <displayName>EMAC_MMCCTRL</displayName>
          <description>Ethernet MAC MMC Control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNTRST</name>
              <description>Counters Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTSTPRO</name>
              <description>Counters Stop Rollover</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RSTONRD</name>
              <description>Reset on Read</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTFREEZ</name>
              <description>MMC Counter Freeze</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTPRST</name>
              <description>Counters Preset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CNTPRSTLVL</name>
              <description>Full/Half Preset Level Value</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UCDBC</name>
              <description>Update MMC Counters for Dropped Broadcast Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRXRIS</name>
          <displayName>EMAC_MMCRXRIS</displayName>
          <description>Ethernet MAC MMC Receive Raw Interrupt Status</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Status</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTXRIS</name>
          <displayName>EMAC_MMCTXRIS</displayName>
          <description>Ethernet MAC MMC Transmit Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Transmit Good Bad Frame Counter Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SCOLLGF</name>
              <description>MMC Transmit Single Collision Good Frame Counter Interrupt Status</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MCOLLGF</name>
              <description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Status</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OCTCNT</name>
              <description>Octet Counter Interrupt Status</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRXIM</name>
          <displayName>EMAC_MMCRXIM</displayName>
          <description>Ethernet MAC MMC Receive Interrupt Mask</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Receive Good Bad Frame Counter Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CRCERR</name>
              <description>MMC Receive CRC Error Frame Counter Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALGNERR</name>
              <description>MMC Receive Alignment Error Frame Counter Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UCGF</name>
              <description>MMC Receive Unicast Good Frame Counter Interrupt Mask</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTXIM</name>
          <displayName>EMAC_MMCTXIM</displayName>
          <description>Ethernet MAC MMC Transmit Interrupt Mask</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GBF</name>
              <description>MMC Transmit Good Bad Frame Counter Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SCOLLGF</name>
              <description>MMC Transmit Single Collision Good Frame Counter Interrupt Mask</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MCOLLGF</name>
              <description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OCTCNT</name>
              <description>MMC Transmit Good Octet Counter Interrupt Mask</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCNTGB</name>
          <displayName>EMAC_TXCNTGB</displayName>
          <description>Ethernet MAC Transmit Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXFRMGB</name>
              <description>This field indicates the number of good and bad frames transmitted, exclusive of retried frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCNTSCOL</name>
          <displayName>EMAC_TXCNTSCOL</displayName>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Single Collision</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXSNGLCOLG</name>
              <description>This field indicates the number of successfully transmitted frames after a single collision in the half-duplex mode</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCNTMCOL</name>
          <displayName>EMAC_TXCNTMCOL</displayName>
          <description>Ethernet MAC Transmit Frame Count for Frames Transmitted after Multiple Collisions</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXMULTCOLG</name>
              <description>This field indicates the number of successfully transmitted frames after multiple collisions in the half-duplex mode</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXOCTCNTG</name>
          <displayName>EMAC_TXOCTCNTG</displayName>
          <description>Ethernet MAC Transmit Octet Count Good</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXOCTG</name>
              <description>This field indicates the number of bytes transmitted, exclusive of preamble, in good frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTGB</name>
          <displayName>EMAC_RXCNTGB</displayName>
          <description>Ethernet MAC Receive Frame Count for Good and Bad Frames</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXFRMGB</name>
              <description>This field indicates the number of received good and bad frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTCRCERR</name>
          <displayName>EMAC_RXCNTCRCERR</displayName>
          <description>Ethernet MAC Receive Frame Count for CRC Error Frames</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXCRCERR</name>
              <description>This field indicates the number of frames received with CRC error</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNTALGNERR</name>
          <displayName>EMAC_RXCNTALGNERR</displayName>
          <description>Ethernet MAC Receive Frame Count for Alignment Error Frames</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXALGNERR</name>
              <description>This field indicates the number of frames received with alignment (dribble) error</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
