m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>RXCNTGUNI</name>
          <displayName>EMAC_RXCNTGUNI</displayName>
          <description>Ethernet MAC Receive Frame Count for Good Unicast Frames</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXUCASTG</name>
              <description>This field indicates the number of received good unicast frames</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VLNINCREP</name>
          <displayName>EMAC_VLNINCREP</displayName>
          <description>Ethernet MAC VLAN Tag Inclusion or Replacement</description>
          <addressOffset>0x00000584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLT</name>
              <description>VLAN Tag for Transmit Frames</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VLC</name>
              <description>VLAN Tag Control in Transmit Frames</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No VLAN tag deletion, insertion, or replacement</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAGDEL</name>
                  <description>VLAN tag deletion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAGINS</name>
                  <description>VLAN tag insertion</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAGREP</name>
                  <description>VLAN tag replacement</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLP</name>
              <description>VLAN Priority Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSVL</name>
              <description>C-VLAN or S-VLAN</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VLANHASH</name>
          <displayName>EMAC_VLANHASH</displayName>
          <description>Ethernet MAC VLAN Hash Table</description>
          <addressOffset>0x00000588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VLHT</name>
              <description>VLAN Hash Table</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTCTRL</name>
          <displayName>EMAC_TIMSTCTRL</displayName>
          <description>Ethernet MAC Timestamp Control</description>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSEN</name>
              <description>Timestamp Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSFCUPDT</name>
              <description>Timestamp Fine or Coarse Update</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSINIT</name>
              <description>Timestamp Initialize</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSUPDT</name>
              <description>Timestamp Update</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTTRIG</name>
              <description>Timestamp Interrupt Trigger Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDREGUP</name>
              <description>Addend Register Update</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ALLF</name>
              <description>Enable Timestamp For All Frames</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DGTLBIN</name>
              <description>Timestamp Digital or Binary Rollover Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPVER2</name>
              <description>Enable PTP Packet Processing For Version 2 Format</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPETH</name>
              <description>Enable Processing of PTP Over Ethernet Frames</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPIPV6</name>
              <description>Enable Processing of PTP Frames Sent Over IPv6-UDP</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PTPIPV4</name>
              <description>Enable Processing of PTP Frames Sent over IPv4-UDP</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSEVNT</name>
              <description>Enable Timestamp Snapshot for Event Messages</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSMAST</name>
              <description>Enable Snapshot for Messages Relevant to Master</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELPTP</name>
              <description>Select PTP packets for Taking Snapshots</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPFLTR</name>
              <description>Enable MAC address for PTP Frame Filtering</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSECINC</name>
          <displayName>EMAC_SUBSECINC</displayName>
          <description>Ethernet MAC Sub-Second Increment</description>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SSINC</name>
              <description>Sub-second Increment Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSEC</name>
          <displayName>EMAC_TIMSEC</displayName>
          <description>Ethernet MAC System Time - Seconds</description>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSS</name>
              <description>Timestamp Second</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMNANO</name>
          <displayName>EMAC_TIMNANO</displayName>
          <description>Ethernet MAC System Time - Nanoseconds</description>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSS</name>
              <description>Timestamp Sub-Seconds</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSECU</name>
          <displayName>EMAC_TIMSECU</displayName>
          <description>Ethernet MAC System Time - Seconds Update</description>
          <addressOffset>0x00000710</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSS</name>
              <description>Timestamp Second</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMNANOU</name>
          <displayName>EMAC_TIMNANOU</displayName>
          <description>Ethernet MAC System Time - Nanoseconds Update</description>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSS</name>
              <description>Timestamp Sub-Second</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>Add or subtract time</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMADD</name>
          <displayName>EMAC_TIMADD</displayName>
          <description>Ethernet MAC Timestamp Addend</description>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSAR</name>
              <description>Timestamp Addend Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGSEC</name>
          <displayName>EMAC_TARGSEC</displayName>
          <description>Ethernet MAC Target Time Seconds</description>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSTR</name>
              <description>Target Time Seconds Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGNANO</name>
          <displayName>EMAC_TARGNANO</displayName>
          <description>Ethernet MAC Target Time Nanoseconds</description>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TTSLO</name>
              <description>Target Timestamp Low Register</description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTBUSY</name>
              <description>Target Time Register Busy</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HWORDSEC</name>
          <displayName>EMAC_HWORDSEC</displayName>
          <description>Ethernet MAC System Time-Higher Word Seconds</description>
          <addressOffset>0x00000724</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSHWR</name>
              <description>Target Timestamp Higher Word Register</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSTAT</name>
          <displayName>EMAC_TIMSTAT</displayName>
          <description>Ethernet MAC Timestamp Status</description>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSSOVF</name>
              <description>Timestamp Seconds Overflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSTARGT</name>
              <description>Timestamp Target Time Reached</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSCTRL</name>
          <displayName>EMAC_PPSCTRL</displayName>
          <description>Ethernet MAC PPS Control</description>
          <addressOffset>0x0000072C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPSCTRL</name>
              <description>EN0PPS Output Frequency Control (PPSCTRL) or Command Control (PPSCMD)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSEN0</name>
              <description>Flexible PPS Output Mode Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRGMODS0</name>
              <description>Target Time Register Mode for PPS0 Output</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for generating the interrupt event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTPPS0</name>
                  <description>Indicates that the Target Time registers are programmed for generating the interrupt event and starting or stopping the generation of the EN0PPS output signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPS0ONLY</name>
                  <description>Indicates that the Target Time registers are programmed only for starting or stopping the generation of the EN0PPS output signal. No interrupt is asserted</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0INTVL</name>
          <displayName>EMAC_PPS0INTVL</displayName>
          <description>Ethernet MAC PPS0 Interval</description>
          <addressOffset>0x00000760</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPS0INT</name>
              <description>PPS0 Output Signal Interval</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPS0WIDTH</name>
          <displayName>EMAC_PPS0WIDTH</displayName>
          <description>Ethernet MAC PPS0 Width</description>
          <addressOffset>0x00000764</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
