m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>TPLOG0</name>
          <displayName>HIB_TPLOG0</displayName>
          <description>HIB Tamper Log 0</description>
          <addressOffset>0x000004E0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIME</name>
              <description>Tamper Log Calendar Information</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG1</name>
          <displayName>HIB_TPLOG1</displayName>
          <description>HIB Tamper Log 1</description>
          <addressOffset>0x000004E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG2</name>
          <displayName>HIB_TPLOG2</displayName>
          <description>HIB Tamper Log 2</description>
          <addressOffset>0x000004E8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIME</name>
              <description>Tamper Log Calendar Information</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG3</name>
          <displayName>HIB_TPLOG3</displayName>
          <description>HIB Tamper Log 3</description>
          <addressOffset>0x000004EC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG4</name>
          <displayName>HIB_TPLOG4</displayName>
          <description>HIB Tamper Log 4</description>
          <addressOffset>0x000004F0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIME</name>
              <description>Tamper Log Calendar Information</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG5</name>
          <displayName>HIB_TPLOG5</displayName>
          <description>HIB Tamper Log 5</description>
          <addressOffset>0x000004F4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG6</name>
          <displayName>HIB_TPLOG6</displayName>
          <description>HIB Tamper Log 6</description>
          <addressOffset>0x000004F8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIME</name>
              <description>Tamper Log Calendar Information</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPLOG7</name>
          <displayName>HIB_TPLOG7</displayName>
          <description>HIB Tamper Log 7</description>
          <addressOffset>0x000004FC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRIG0</name>
              <description>Status of TMPR[0] Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG1</name>
              <description>Status of TMPR[1] Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG2</name>
              <description>Status of TMPR[2] Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRIG3</name>
              <description>Status of TMPR[3] Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XOSC</name>
              <description>Status of external 32</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>HIB_PP</displayName>
          <description>Hibernation Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAKENC</name>
              <description>Wake Pin Presence</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAMPER</name>
              <description>Tamper Pin Presence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>HIB_CC</displayName>
          <description>Hibernation Clock Control</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCLKEN</name>
              <description>RTCOSC to System Clock Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
