m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>NMIC</name>
          <displayName>SYSCTL_NMIC</displayName>
          <description>NMI Cause Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXTERNAL</name>
              <description>External Pin NMI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POWER</name>
              <description>Power/Brown Out Event NMI</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT0</name>
              <description>Watch Dog Timer (WDT) 0 NMI</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT1</name>
              <description>Watch Dog Timer (WDT) 1 NMI</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAMPER</name>
              <description>Tamper Event NMI</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCFAIL</name>
              <description>MOSC Failure NMI</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MOSCCTL</name>
          <displayName>SYSCTL_MOSCCTL</displayName>
          <description>Main Oscillator Control</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CVAL</name>
              <description>Clock Validation for MOSC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCIM</name>
              <description>MOSC Failure Action</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NOXTAL</name>
              <description>No Crystal Connected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWRDN</name>
              <description>Power Down</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OSCRNG</name>
              <description>Oscillator Range</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RSCLKCFG</name>
          <displayName>SYSCTL_RSCLKCFG</displayName>
          <description>Run and Sleep Mode Configuration Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSYSDIV</name>
              <description>PLL System Clock Divisor</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSYSDIV</name>
              <description>Oscillator System Clock Divisor</description>
              <lsb>10</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCSRC</name>
              <description>Oscillator Source</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC is oscillator source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFIOSC</name>
                  <description>LFIOSC is oscillator source</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>MOSC is oscillator source</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC</name>
                  <description>Hibernation Module RTC Oscillator (RTCOSC)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSRC</name>
              <description>PLL Source</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC is PLL input clock source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>MOSC is the PLL input clock source</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEPLL</name>
              <description>Use PLL</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACG</name>
              <description>Auto Clock Gating</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEWFREQ</name>
              <description>New PLLFREQ Accept</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MEMTIMU</name>
              <description>Memory Timing Register Update</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMTIM0</name>
          <displayName>SYSCTL_MEMTIM0</displayName>
          <description>Memory Timing Parameter Register 0 for Main Flash and EEPROM</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FWS</name>
              <description>Flash Wait State</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FBCE</name>
              <description>Flash Bank Clock Edge</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FBCHT</name>
              <description>Flash Bank Clock High Time</description>
              <lsb>6</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0_5</name>
                  <description>1/2 system clock period</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>1 system clock period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_5</name>
                  <description>1.5 system clock periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>2 system clock periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_5</name>
                  <description>2.5 system clock periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>3 system clock periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_5</name>
                  <description>3.5 system clock periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>4 system clock periods</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_5</name>
                  <description>4.5 system clock periods</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EWS</name>
              <description>EEPROM Wait States</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EBCE</name>
              <description>EEPROM Bank Clock Edge</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EBCHT</name>
              <description>EEPROM Clock High Time</description>
              <lsb>22</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0_5</name>
                  <description>1/2 system clock period</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>1 system clock period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_5</name>
                  <description>1.5 system clock periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>2 system clock periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_5</name>
                  <description>2.5 system clock periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>3 system clock periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_5</name>
                  <description>3.5 system clock periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>4 system clock periods</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_5</name>
                  <description>4.5 system clock periods</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTCLKCFG</name>
          <displayName>SYSCTL_ALTCLKCFG</displayName>
          <description>Alternate Clock Configuration</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ALTCLK</name>
              <description>Alternate Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCOSC</name>
                  <description>Hibernation Module Real-time clock output (RTCOSC)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFIOSC</name>
                  <description>Low-frequency internal oscillator (LFIOSC)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCLKCFG</name>
          <displayName>SYSCTL_DSCLKCFG</displayName>
          <description>Deep Sleep Clock Configuration Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DSSYSDIV</name>
              <description>Deep Sleep Clock Divisor</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSOSCSRC</name>
              <description>Deep Sleep Oscillator Source</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFIOSC</name>
                  <description>LFIOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>MOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC</name>
                  <description>Hibernation Module RTCOSC</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOSCDPD</name>
              <description>MOSC Disable Power Down</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PIOSCPD</name>
              <description>PIOSC Power Down</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVSCLK</name>
          <displayName>SYSCTL_DIVSCLK</displayName>
          <description>Divisor and Source Clock Configuration</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIV</name>
              <description>Divisor Value</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC</name>
              <description>Clock Source</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System Clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOSC</name>
                  <description>MOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>DIVSCLK Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPROP</name>
          <displayName>SYSCTL_SYSPROP</displayName>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FPU</name>
              <description>FPU Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
