m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>DCGCTIMER</name>
          <displayName>SYSCTL_DCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>16/32-Bit General-Purpose Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>16/32-Bit General-Purpose Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>16/32-Bit General-Purpose Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>16/32-Bit General-Purpose Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D4</name>
              <description>16/32-Bit General-Purpose Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D5</name>
              <description>16/32-Bit General-Purpose Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D6</name>
              <description>16/32-Bit General-Purpose Timer 6 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D7</name>
              <description>16/32-Bit General-Purpose Timer 7 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCGPIO</name>
          <displayName>SYSCTL_DCGCGPIO</displayName>
          <description>General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>GPIO Port A Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>GPIO Port B Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>GPIO Port C Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>GPIO Port D Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D4</name>
              <description>GPIO Port E Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D5</name>
              <description>GPIO Port F Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D6</name>
              <description>GPIO Port G Deep-Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D7</name>
              <description>GPIO Port H Deep-Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D8</name>
              <description>GPIO Port J Deep-Sleep Mode Clock Gating Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D9</name>
              <description>GPIO Port K Deep-Sleep Mode Clock Gating Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D10</name>
              <description>GPIO Port L Deep-Sleep Mode Clock Gating Control</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D11</name>
              <description>GPIO Port M Deep-Sleep Mode Clock Gating Control</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D12</name>
              <description>GPIO Port N Deep-Sleep Mode Clock Gating Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D13</name>
              <description>GPIO Port P Deep-Sleep Mode Clock Gating Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D14</name>
              <description>GPIO Port Q Deep-Sleep Mode Clock Gating Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCDMA</name>
          <displayName>SYSCTL_DCGCDMA</displayName>
          <description>Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000080C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>uDMA Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEPI</name>
          <displayName>SYSCTL_DCGCEPI</displayName>
          <description>EPI Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>EPI Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCHIB</name>
          <displayName>SYSCTL_DCGCHIB</displayName>
          <description>Hibernation Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Hibernation Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUART</name>
          <displayName>SYSCTL_DCGCUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>UART Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>UART Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>UART Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>UART Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D4</name>
              <description>UART Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D5</name>
              <description>UART Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D6</name>
              <description>UART Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D7</name>
              <description>UART Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCSSI</name>
          <displayName>SYSCTL_DCGCSSI</displayName>
          <description>Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000081C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>SSI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>SSI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>SSI Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>SSI Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
