m-labs/dslite2svd/svd/tm4c129x-vendor.xml
        <register>
          <name>PRI2C</name>
          <displayName>SYSCTL_PRI2C</displayName>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>I2C Module 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>I2C Module 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R6</name>
              <description>I2C Module 6 Peripheral Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R7</name>
              <description>I2C Module 7 Peripheral Ready</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R8</name>
              <description>I2C Module 8 Peripheral Ready</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R9</name>
              <description>I2C Module 9 Peripheral Ready</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUSB</name>
          <displayName>SYSCTL_PRUSB</displayName>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>USB Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PREPHY</name>
          <displayName>SYSCTL_PREPHY</displayName>
          <description>Ethernet PHY Peripheral Ready</description>
          <addressOffset>0x00000A30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Ethernet PHY Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCAN</name>
          <displayName>SYSCTL_PRCAN</displayName>
          <description>Controller Area Network Peripheral Ready</description>
          <addressOffset>0x00000A34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CAN Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>CAN Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRADC</name>
          <displayName>SYSCTL_PRADC</displayName>
          <description>Analog-to-Digital Converter Peripheral Ready</description>
          <addressOffset>0x00000A38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>ADC Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>ADC Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRACMP</name>
          <displayName>SYSCTL_PRACMP</displayName>
          <description>Analog Comparator Peripheral Ready</description>
          <addressOffset>0x00000A3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Analog Comparator Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRPWM</name>
          <displayName>SYSCTL_PRPWM</displayName>
          <description>Pulse Width Modulator Peripheral Ready</description>
          <addressOffset>0x00000A40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>PWM Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRQEI</name>
          <displayName>SYSCTL_PRQEI</displayName>
          <description>Quadrature Encoder Interface Peripheral Ready</description>
          <addressOffset>0x00000A44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>QEI Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PREEPROM</name>
          <displayName>SYSCTL_PREEPROM</displayName>
          <description>EEPROM Peripheral Ready</description>
          <addressOffset>0x00000A58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>EEPROM Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCCM</name>
          <displayName>SYSCTL_PRCCM</displayName>
          <description>CRC and Cryptographic Modules Peripheral Ready</description>
          <addressOffset>0x00000A74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CRC and Cryptographic Modules Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PREMAC</name>
          <displayName>SYSCTL_PREMAC</displayName>
          <description>Ethernet MAC Peripheral Ready</description>
          <addressOffset>0x00000A9C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Ethernet MAC Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
