m-labs/dslite2svd/svd/tm4c129x-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce290ncpz/ccm.xml -->
    <peripheral>
      <name>CCM0</name>
      <description>EC register offsets</description>
      <baseAddress>0x44030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CRCCTRL</name>
          <displayName>CCM_CRCCTRL</displayName>
          <description>CRC Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Operation Type</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P8055</name>
                  <description>Polynomial 0x8005</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1021</name>
                  <description>Polynomial 0x1021</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4C11DB7</name>
                  <description>Polynomial 0x4C11DB7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1EDC6F41</name>
                  <description>Polynomial 0x1EDC6F41</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCPCHKSUM</name>
                  <description>TCP checksum</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>Endian Control</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SBHW</name>
                  <description>Configuration unchanged. (B3, B2, B1, B0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHW</name>
                  <description>Bytes are swapped in half-words but half-words are not swapped (B2, B3, B0, B1)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHWNB</name>
                  <description>Half-words are swapped but bytes are not swapped in half-word. (B1, B0, B3, B2)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBSW</name>
                  <description>Bytes are swapped in half-words and half-words are swapped. (B0, B1, B2, B3)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BR</name>
              <description>Bit reverse enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OBR</name>
              <description>Output Reverse Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESINV</name>
              <description>Result Inverse Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SIZE</name>
              <description>Input Data Size</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INIT</name>
              <description>CRC Initialization</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEED</name>
                  <description>Use the CRCSEED register context as the starting value</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Initialize to all '0s'</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Initialize to all '1s'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSEED</name>
          <displayName>CCM_CRCSEED</displayName>
          <description>CRC SEED/Context</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEED</name>
              <description>SEED/Context Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDIN</name>
          <displayName>CCM_CRCDIN</displayName>
          <description>CRC Data Input</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATAIN</name>
              <description>Data Input</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCRSLTPP</name>
          <displayName>CCM_CRCRSLTPP</displayName>
          <description>CRC Post Processing Result</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RSLTPP</name>
              <description>Post Processing Result</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
